var tableColors = ['#ffff00', '#00ff00', '#0000ff', '#4f4f7a', '#88ff00'];
var buttonIds = ['#btn0', '#btn1', '#btn2', '#btn3', '#btn4'];

var mainOptions = {
    '教員': 0,
    'クラス': 1,
    '教室': 2,
}

var roleOptions = {
    '全所属': 0,
    '情報アーキテクチャ学科': '情報アーキテクチャ学科',
    '複雑系知能学科': '複雑系知能学科',
    '社会連携センター': '社会連携センター',
    'メタ学習センター': 'メタ学習センター'
}

var courseOptions = {
    '全コース': 0,
    '未所属': '未所属',
    '情報システムコース': '情報システムコース',
    '情報デザインコース': '情報デザインコース',
    '複雑系コース': '複雑系コース',
    '知能システムコース': '知能システムコース',
    '高度ICTコース': '高度ICTコース',
}

var classNumOptions = {
    '全クラス': 0,
    'A': 1,
    'B': 2,
    'C': 3,
    'D': 4,
    'E': 5,
    'F': 6,
    'G': 7,
    'H': 8,
    'I': 9,
    'J': 10,
    'K': 11,
    'L': 12
}
var gradeOptions = {
    '全学年': 0,
    '1年': 1,
    '2年': 2,
    '3年': 3,
    '4年': 4,
    'M1': 5,
    'M2': 6,
}